## `infra/terraform/prod`
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_acm_certificate.libra_us-east-1: Reading...
data.aws_acm_certificate.libra_us-east-1: Read complete after 0s [id=arn:aws:acm:us-east-1:518773205675:certificate/d38bfd5d-6f2f-4649-a701-9e1dda197630]
data.aws_route53_zone.tomozo6_com: Reading...
aws_s3_bucket.website: Refreshing state... [id=libra-prod-website-s3]
aws_dynamodb_table.libra: Refreshing state... [id=libra-prod-dynamodb-table]
aws_s3_bucket.log: Refreshing state... [id=libra-prod-log-s3]
data.aws_route53_zone.tomozo6_com: Read complete after 1s [id=Z0406418180720KM8VM2D]
aws_s3_bucket_server_side_encryption_configuration.log: Refreshing state... [id=libra-prod-log-s3]
aws_s3_bucket_acl.log: Refreshing state... [id=libra-prod-log-s3,log-delivery-write]
aws_s3_bucket_ownership_controls.website: Refreshing state... [id=libra-prod-website-s3]
aws_s3_bucket_server_side_encryption_configuration.website: Refreshing state... [id=libra-prod-website-s3]
aws_s3_bucket_logging.website: Refreshing state... [id=libra-prod-website-s3]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=libra-prod-website-s3]
aws_s3_bucket_policy.website: Refreshing state... [id=libra-prod-website-s3]
aws_s3_bucket_website_configuration.website: Refreshing state... [id=libra-prod-website-s3]
aws_cloudfront_distribution.libra: Refreshing state... [id=E8Y4W2WTHC8TM]
aws_route53_record.libra: Refreshing state... [id=Z0406418180720KM8VM2D_www.libra.tomozo6.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudfront_distribution.libra will be updated in-place
  ~ resource "aws_cloudfront_distribution" "libra" {
        id                             = "E8Y4W2WTHC8TM"
        tags                           = {
            "created_by" = "terraform"
            "env"        = "prod"
            "project"    = "libra"
        }
        # (20 unchanged attributes hidden)

      ~ default_cache_behavior {
          ~ cached_methods         = [
              + "OPTIONS",
                # (2 unchanged elements hidden)
            ]
            # (10 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      ~ ordered_cache_behavior {
          ~ allowed_methods        = [
              + "DELETE",
              + "PATCH",
              + "POST",
              + "PUT",
                # (3 unchanged elements hidden)
            ]
            # (11 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # aws_dynamodb_table.libra will be destroyed
  # (because aws_dynamodb_table.libra is not in configuration)
  - resource "aws_dynamodb_table" "libra" {
      - arn            = "arn:aws:dynamodb:ap-northeast-1:518773205675:table/libra-prod-dynamodb-table" -> null
      - billing_mode   = "PROVISIONED" -> null
      - hash_key       = "Payer" -> null
      - id             = "libra-prod-dynamodb-table" -> null
      - name           = "libra-prod-dynamodb-table" -> null
      - range_key      = "InputDate" -> null
      - read_capacity  = 1 -> null
      - stream_enabled = false -> null
      - tags           = {} -> null
      - tags_all       = {} -> null
      - write_capacity = 1 -> null

      - attribute {
          - name = "InputDate" -> null
          - type = "S" -> null
        }
      - attribute {
          - name = "Payer" -> null
          - type = "S" -> null
        }

      - point_in_time_recovery {
          - enabled = false -> null
        }

      - ttl {
          - enabled = false -> null
        }
    }

  # aws_dynamodb_table.pay will be created
  + resource "aws_dynamodb_table" "pay" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "Payer"
      + id               = (known after apply)
      + name             = "libra-prod-pay-dynamodb-table"
      + range_key        = "InputDate"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 1

      + attribute {
          + name = "InputDate"
          + type = "S"
        }
      + attribute {
          + name = "Payer"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = (known after apply)
          + enabled        = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @tomozo6, Action: `pull_request`*